01  WS-AREA.         
05  WS-NUMBER PIC 9(5). 
05  WS-FLAG PIC X VALUE 'N'.
05 WS-OVERFLOW-FLAG PIC X VALUE 'N'.

PROCEDURE DIVISION.
...
ADD 1 TO WS-NUMBER ON SIZE ERROR MOVE 'Y' TO WS-OVERFLOW-FLAG 
IF WS-OVERFLOW-FLAG = 'Y' THEN
    DISPLAY "Numeric Overflow occurred." 
    MOVE 'Y' TO WS-FLAG
END-IF
...